# St7GetSturmCheck

Returns the state of the Sturm Check option, for eigenvalue analyses.

long St7GetSturmCheck(long uID, bool* DoSturm)
Input Parameters
uID
Strand7 model file ID.
Output Parameters
DoSturm
True if the Sturm Check is enabled.